<?php

use Illuminate\Support\Facades\Schema;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Database\Migrations\Migration;

class AddMasterBankTable extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        Schema::create('master_bank', function (Blueprint $table) {
            //
            $table->string('bankCode',6)->unique();
            $table->string('bankName_th',220);
            $table->string('bankName_en',220);
            $table->string('remark',220);
            $table->string('swiftCode',20);
            $table->timestamps();
            $table->engine = 'InnoDB';
            $table->charset = 'utf8';
            $table->collation = 'utf8_unicode_ci';
        });
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        Schema::table('master_bank', function (Blueprint $table) {
            //
        });
    }
}
// รหัสธนาคาร,ธนาคาร,ก่อตั้ง,ประเภท,หมายเหตุ,รหัส SWIFTCODE
// 001,ธนาคารแห่งประเทศไทย,2485,ธนาคารแห่งชาติ,เดิมคือ สำนักงานธนาคารชาติไทย มีหน้าที่กำกับดูแลธนาคารพาณิชย์ไทย,BOTHTHBK
// 002,ธนาคารกรุงเทพ,2487,บริษัทมหาชน SET: BBL,,BKKBTHBK
// 004,ธนาคารกสิกรไทย,2488,บริษัทมหาชน SET: KBANK,,KASITHBK
// 006,ธนาคารกรุงไทย,2509,บริษัทมหาชน SET: KTB,ธนาคารรัฐวิสาหกิจของไทย ก่อตั้งโดยควบรวมกิจการธนาคารมณฑล ธนาคารเกษตร (พ.ศ. 2509) และธนาคารมหานคร (พ.ศ. 2541),KRTHTHBK
// 011,ธนาคารทหารไทย,2499,บริษัทมหาชน SET: TMB,,TMBKTHB
// 014,ธนาคารไทยพาณิชย์,2449,บริษัทมหาชน SET: SCB,เดิมชื่อธนาคารสยามกัมมาจล และเปลี่ยนชื่อเป็นธนาคารไทยพาณิชย์ (พ.ศ. 2482),SICOTHBK
// 025,ธนาคารกรุงศรีอยุธยา,2488,บริษัทมหาชน SET: BAY,เดิมใช้ชื่อว่า ธนาคารแห่งกรุงศรีอยุธยา จำกัด จนถึงปี พ.ศ. 2512,AYUDTHBK
// 069,ธนาคารเกียรตินาคิน,2548,บริษัทมหาชน SET: KKP,เดิมคือ บริษัท เงินทุน เกียรตินาคิน จำกัด(มหาชน),KIFITHB1
// 022,ธนาคารซีไอเอ็มบีไทย,2552,บริษัทมหาชน SET: CIMB,เปลี่ยนชื่อจาก ธนาคารไทยธนาคาร จำกัด (มหาชน) เมื่อ 4 พ.ค. 2552,UBOBTHBK
// 067,ธนาคารทิสโก้,2548,บริษัทมหาชน SET: TISCO,เดิมคือ บริษัท เงินทุน ทิสโก้ จำกัด (มหาชน),TFPCTHB1
// 065,ธนาคารธนชาต,2545,บริษัทมหาชน SET: TBANK,เดิมคือ บริษัท เงินทุน เอกชาติ จำกัด (มหาชน),THBKTHBK
// 024,ธนาคารยูโอบี,2548,บริษัทมหาชน SET: UOB,เปลี่ยนชื่อมาจาก ธนาคารยูไนเต็ด โอเวอร์ซีส์ (ไทย) จำกัด (มหาชน) เมื่อ 2 พฤษภาคม 2549,UOVBTHBK
// 020,ธนาคารสแตนดาร์ดชาร์เตอร์ด (ไทย),2548,บริษัทมหาชน SET: SCBT,เปลี่ยนชื่อมาจาก ธนาคารสแตนดาร์ดชาร์เตอร์ด นครธน จำกัด (มหาชน) เมื่อ 1 ตุลาคม 2548,SCBLTHBX
// 071,ธนาคารไทยเครดิตเพื่อรายย่อย,2547,บริษัทมหาชน SET: TCD,ธนาคารพาณิชย์เพื่อรายย่อย เดิมคือ บริษัท กรุงเทพสินทวี จำกัด (ก่อตั้ง พ.ศ. 2513),
// 073,ธนาคารแลนด์ แอนด์ เฮาส์,2547,บริษัทมหาชน SET: LHBANK,ปรับสถานะจากธนาคารพาณิชย์เพื่อรายย่อยเป็นธนาคารพาณิชย์เต็มรูปแบบ โดยเปลี่ยนชื่อมาจาก ธนาคารแลนด์ แอนด์ เฮ้าส์ เพื่อรายย่อย เมื่อ 19 ธันวาคม 2554,LAHRTHB1
// 070,ธนาคารไอซีบีซี (ไทย),2553,บริษัทมหาชน SET: ICBC,เปลี่ยนชื่อมาจาก ธนาคารสินเอเซียเมื่อวันที่ 8 กรกฎาคม 2553,ICBKTHBK
// 098,ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อมแห่งประเทศไทย,2545,ธนาคารของรัฐบาล ตัวอักษรย่อ: SME,เดิมคือ บรรษัทเงินทุนอุตสาหกรรมขนาดย่อม,-
// 034,ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร,2486,ธนาคารของรัฐบาล ตัวอักษรย่อ: BAAC,เดิมชื่อ ธนาคารเพื่อการสหกรณ์,BAABTHBK
// 035,ธนาคารเพื่อการส่งออกและนำเข้าแห่งประเทศไทย,2536,ธนาคารของรัฐบาล ตัวอักษรย่อ: EXIM,,EXTHTHBK
// 030,ธนาคารออมสิน,2456,ธนาคารของรัฐบาล ตัวอักษรย่อ: GSB,เปลี่ยนชื่อมาจากคลังออมสิน (2490),GSBATHBK
// 033,ธนาคารอาคารสงเคราะห์,2496,ธนาคารของรัฐบาล ตัวอักษรย่อ: GHB,,
// 066,ธนาคารอิสลามแห่งประเทศไทย,2545,ธนาคารของรัฐบาล ตัวอักษรย่อ: ISALAM,,TIBTTHBK
// 026,ธนาคารเมกะ สากลพาณิชย์,2548,บริษัทมหาชน,ยกฐานะจากสาขา ธนาคารพาณิชย์ต่างประเทศ เป็นธนาคารพาณิชย์ที่เป็นบริษัทลูกของธนาคารต่างประเทศ เมื่อวันที่ 8 สิงหาคม 2548,ICBCTHBKBNA
// 052,ธนาคารแห่งประเทศจีน,2557,บริษัทมหาชน,ยกฐานะจากสาขา ธนาคารพาณิชย์ต่างประเทศ เป็นธนาคารพาณิชย์ที่เป็นบริษัทลูกของธนาคารต่างประเทศ เมื่อวันที่ 26 สิงหาคม 2557,BKCHTHBK
// 079,ธนาคารเอเอ็นแซด (ไทย),2558,บริษัทมหาชน,,ANZBTHBK
// 080,ธนาคารซูมิโตโม มิตซุย ทรัสต์ (ไทย),2558,บริษัทมหาชน,,STBCTHBK